In [1]:
import sys 

sys.path.insert(1, '../src')
import katie_work

In [2]:
df_contracts, df_customers = katie_work.load_data()

df_contracts.head()

,contract_id,customer_id,contract_start,contract_term,deposit,monthly_amt
0,1,127,8/17/19,12,"$53,000.00","$11,600.00"
1,2,119,12/1/19,22,"$77,000.00","$14,600.00"
2,3,160,5/1/19,15,"$13,000.00","$22,800.00"
3,4,7,12/8/19,23,"$56,000.00","$11,400.00"
4,5,144,2/11/19,7,"$21,000.00","$19,800.00"

In [3]:
df_customers.head()

,id,company,sector,industry,email,address,city,state,zip
0,1,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,2,Izio,Energy,Oil & Gas Production,farlet1@comcast.net,15360 Village Green Street,Spokane,WA,99252
2,3,Twitterworks,NaN,NaN,alerohan2@ox.ac.uk,29 Hovde Hill,Milwaukee,WI,53234
3,4,Viva,Health Care,Major Pharmaceuticals,wgiovanitti3@nytimes.com,074 Center Place,Topeka,KS,66667
4,5,Jabberstorm,Technology,Computer Software: Prepackaged Software,pscallon4@fc2.com,4 Moose Way,Terre Haute,IN,47805

In [4]:
df = katie_work.combine_data(df_contracts, df_customers)
df.head()

,contract_id,contract_start,contract_term,deposit,monthly_amt,company,sector,industry,email,address,city,state,zip
customer_id,,,,,,,,,,,,,
1,41,5/31/19,24,"$86,000.00","$11,200.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,358,6/18/19,13,"$74,000.00","$19,000.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,400,8/11/19,19,"$38,000.00","$8,800.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,424,3/13/19,15,"$77,000.00","$14,300.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,438,10/16/19,22,"$39,000.00","$20,000.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170

In [5]:
import pandas as pd

Data = {'deposit': ['86000','74000','38000','77000','39000'],
        'month_amt': ['11,200','19,000','8800','14300','20000']}
  
df = pd.DataFrame(Data)
  
df['deposit'] = df['deposit'].astype(int)
    
print(df)

   deposit month_amt
0    86000    11,200
1    74000    19,000
2    38000      8800
3    77000     14300
4    39000     20000

In [6]:
import pandas as pd
  
# Creating the dataframe 
df_contracts = pd.read_csv('../data/contracts.csv')
  
# Print the dataframe
df

   deposit month_amt
0    86000    11,200
1    74000    19,000
2    38000      8800
3    77000     14300
4    39000     20000

In [7]:
# applying groupby() function to
# group the data on team value.
gkk = df.groupby(['deposit','month_amt'])

  
# Let's print the first entries
# in all the groups formed.
gkk.first()

Empty DataFrame
Columns: []
Index: [(38000, 8800), (39000, 20000), (74000, 19,000), (77000, 14300), (86000, 11,200)]